# 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга. Если в рейтинге существуют элементы с одинаковыми
# значениями, то новый элемент с тем же значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].

source_list = [10, 6, 5, 5, 2, 1]
print('Исходный рейтинг: ', *source_list)
# ввод трех дополнительных рейтингов
while len(source_list) != 9:
    source_list.append(int(input('Введите значение рейтинга: ')))
    source_list.sort()
    source_list.reverse()
    print('Новый рейтинг :', *source_list)